In [1]:
import pandas as pd

In [2]:
pd.DataFrame([{'a':1, 'b':2}, {'b':3, 'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [3]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [4]:
indA.intersection(indB)

Int64Index([3, 5, 7], dtype='int64')

# 3.3 数据取值与选择
## 3.3.1 Series数据选择方法

In [5]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index = ['a','b','c','d'])

In [6]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [7]:
data[
    'b'
]

0.5

In [8]:
'a' in data

True

In [9]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
data['e'] = 1.25

In [11]:
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [13]:
data[['a','e']]

a    0.25
e    1.25
dtype: float64

In [14]:
data = pd.Series(['a','b','c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [15]:
data[1]

'a'

In [16]:
data[1:3]

3    b
5    c
dtype: object

In [17]:
data.loc[1]

'a'

In [18]:
data.loc[1:3]

1    a
3    b
dtype: object

In [19]:
data.iloc[1]

'b'

In [20]:
data.iloc[1:3]

3    b
5    c
dtype: object

## 3.3.2 DataFrame数据选择方法

In [23]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [24]:
data = pd.DataFrame({'area':area, 'pop':pop})

In [25]:
data

                 area         pop
Alaska      1723337.0         NaN
California   423967.0  38332521.0
New York          NaN  19651127.0
Texas        695662.0  26448193.0

In [26]:
data['density'] = data['pop'] / data['area']

In [27]:
data

                 area         pop    density
Alaska      1723337.0         NaN        NaN
California   423967.0  38332521.0  90.413926
New York          NaN  19651127.0        NaN
Texas        695662.0  26448193.0  38.018740

# 3.4 Pandas数值运算方法
## 3.4.1 通用函数：保留索引

In [29]:
import numpy as np
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [30]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [33]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [35]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [36]:
A = pd.Series([2, 4, 6], index=[0,1,2])
B = pd.Series([1, 3, 5], index=[1,2,3])
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [37]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [39]:
A = pd.DataFrame(rng.randint(0, 20,(2,2)),
                columns=list('AB'))
A

   A  B
0  3  7
1  2  1

In [40]:
B = pd.DataFrame(rng.randint(0,10,(3,3)),
                columns=list('BAC'))

In [41]:
B

   B  A  C
0  7  5  1
1  4  0  9
2  5  8  0

In [42]:
A + B

     A     B   C
0  8.0  14.0 NaN
1  2.0   5.0 NaN
2  NaN   NaN NaN

In [43]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

       A      B      C
0   8.00  14.00   4.25
1   2.00   5.00  12.25
2  11.25   8.25   3.25

In [46]:
A = rng.randint(10,size=(3,4))

In [47]:
A

array([[9, 2, 6, 3],
       [8, 2, 4, 2],
       [6, 4, 8, 6]])

In [48]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1,  0, -2, -1],
       [-3,  2,  2,  3]])

In [49]:
df = pd.DataFrame(A, columns = list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1  0 -2 -1
2 -3  2  2  3

In [50]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  7  0  4  1
1  6  0  2  0
2  2  0  4  2

In [54]:
halfrow = df.iloc[0, ::2]
halfrow

Q    9
S    6
Name: 0, dtype: int32

In [56]:
print(df)
df - halfrow

   Q  R  S  T
0  9  2  6  3
1  8  2  4  2
2  6  4  8  6

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN -2.0 NaN
2 -3.0 NaN  2.0 NaN

# 3.6 层级索引

In [1]:
import numpy as np
import pandas as pd

In [2]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]

In [3]:
pop = pd.Series(populations, index=index)

In [4]:
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [9]:
pop[('California',2010):('Texas',2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [10]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [11]:
pop = pop.reindex(index)

In [12]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [15]:
pop[: ,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [16]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [17]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [18]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})

In [19]:
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [20]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [23]:
df = pd.DataFrame(np.random.rand(4,2),
                  index = [['a','a','b','b'],[1, 2, 1, 2]],
                  columns = ['data1','data2'])
df

        data1     data2
a 1  0.717641  0.936387
  2  0.234802  0.468447
b 1  0.373168  0.527089
  2  0.248595  0.717556

In [24]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [26]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [28]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [29]:
pd.MultiIndex.from_product([['a','b'],[1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [30]:
pd.MultiIndex(levels=[['a','b'],[1,2]],
             labels = [[0,0,1,1],[0,1,0,1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [31]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

In [33]:
data = np.round(np.random.randn(4, 6),1)
data[:, ::2] *= 10
data += 37

In [34]:
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      52.0  36.9  44.0  36.7  32.0  36.7
     2      42.0  38.7  54.0  36.7  52.0  36.0
2014 1      27.0  36.7  21.0  37.6  26.0  36.6
     2      44.0  36.5  28.0  37.2  47.0  37.5

In [45]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      44.0  36.7
     2      54.0  36.7
2014 1      21.0  37.6
     2      28.0  37.2

In [39]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [40]:
pop['California',2000]

33871648

In [41]:
pop['California']

2000    33871648
2010    37253956
dtype: int64

In [46]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      52.0  36.9  44.0  36.7  32.0  36.7
     2      42.0  38.7  54.0  36.7  52.0  36.0
2014 1      27.0  36.7  21.0  37.6  26.0  36.6
     2      44.0  36.5  28.0  37.2  47.0  37.5

In [54]:
health_data['Guido','Temp']

year  visit
2013  1        36.7
      2        36.7
2014  1        37.6
      2        37.2
Name: (Guido, Temp), dtype: float64

In [55]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      52.0  36.9
     2      42.0  38.7

In [56]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        52.0
      2        42.0
2014  1        27.0
      2        44.0
Name: (Bob, HR), dtype: float64

In [57]:
health_data.loc[(:, 1),(:, 'HR')]

SyntaxError: invalid syntax (<ipython-input-57-22c7e58ea242>, line 1)

In [58]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      52.0  44.0  32.0
2014 1      27.0  21.0  26.0

In [59]:
index = pd.MultiIndex.from_product([['a','c','b'],[1,2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char','int']
data

char  int
a     1      0.812243
      2      0.989330
c     1      0.947352
      2      0.467145
b     1      0.264366
      2      0.548573
dtype: float64

In [63]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [64]:
data = data.sort_index()
data

char  int
a     1      0.812243
      2      0.989330
b     1      0.264366
      2      0.548573
c     1      0.947352
      2      0.467145
dtype: float64

In [66]:
data['a':'b']

char  int
a     1      0.812243
      2      0.989330
b     1      0.264366
      2      0.548573
dtype: float64